Revit 2022 API
SpecUtils.GetParameterType Method
 Gets the ParameterType value corresponding to the given spec identifier.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2022
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2022 and may be removed in a future version of Revit. It will not be replaced, but until its removal it may be used to help migrate code that uses the 'ParameterType' enumeration to the ForgeTypeId class.")]
public static ParameterType GetParameterType(
	ForgeTypeId specTypeId
)
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2022 and may be removed in a future version of Revit. It will not be replaced, but until its removal it may be used to help migrate code that uses the 'ParameterType' enumeration to the ForgeTypeId class.")> _
Public Shared Function GetParameterType ( _
	specTypeId As ForgeTypeId _
) As ParameterType
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2022 and may be removed in a future version of Revit. It will not be replaced, but until its removal it may be used to help migrate code that uses the 'ParameterType' enumeration to the ForgeTypeId class.")]
public:
static ParameterType GetParameterType(
	ForgeTypeId^ specTypeId
)
Parameters
specTypeId
Type: Autodesk.Revit.DB.ForgeTypeId
 The spec identifier.
Return Value
 The ParameterType value corresponding to the given spec identifier.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  specTypeId is not a spec identifier.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
SpecUtils Class
Autodesk.Revit.DB Namespace